{
    "movies": [
        {
            "title": "1917",
            "director": "Sam Mendes",
            "release_date": "10 January 2020",
            "runtime": 119,
            "rating": 8.3,
            "description": "April 1917, the Western Front. Two British soldiers are sent to deliver an urgent message to an isolated regiment. If the message is not received in time the regiment will walk into a trap and be massacred. To get to the regiment they will need to cross through enemy territory. Time is of the essence and the journey will be fraught with danger.",
            "genres": [
                "Action",
                "Drama",
                "War"
            ],
            "photos": "https://nerdreactor.com/wp-content/uploads/2019/11/1917-poster.jpg"
        },
        {
            "title": "Interstellar",
            "director": "Christopher Nolan",
            "release_date": "7 November 2014",
            "runtime": 169,
            "rating": 8.6,
            "description": "Earth's future has been riddled by disasters, famines, and droughts. There is only one way to ensure mankind's survival: Interstellar travel. A newly discovered wormhole in the far reaches of our solar system allows a team of astronauts to go where no man has gone before, a planet that may have the right environment to sustain human life.",
            "genres": [
                "Adventure",
                "Drama",
                "Sci-Fi"
            ],
            "photo": "https://ichef.bbci.co.uk/news/640/amz/worldservice/live/assets/images/2014/11/18/141118190103_interstellar_poster_640x360_getty_nocredit.jpg"
        },
        {
            "title": "The Pianist",
            "director": "Roman Polanski",
            "release_date": "28 Maret 2003",
            "runtime": 150,
            "rating": 8.5,
            "description": "In this adaptation of the autobiography 'The Pianist: The Extraordinary True Story of One Man's Survival in Warsaw, 1939-1945,' Wladyslaw Szpilman, a Polish Jewish radio station pianist, sees Warsaw change gradually as World War II begins. Szpilman is forced into the Warsaw Ghetto, but is later separated from his family during Operation Reinhard. From this time until the concentration camp prisoners are released, Szpilman hides in various locations among the ruins of Warsaw.",
            "genres": [
                "Biography",
                "Drama",
                "Music",
                "War"
            ],
            "photo": "https://www.cultura.id/wp-content/uploads/2020/06/Adrien-Brody-The-Pianist.jpg"
        },
        {
            "title": "Avengers: Endgame",
            "director": "Russo Brothers",
            "release_date": "26 April 2019",
            "runtime": 181,
            "rating": 8.4,
            "description": "After the devastating events of Avengers: Infinity War (2018), the universe is in ruins due to the efforts of the Mad Titan, Thanos. With the help of remaining allies, the Avengers must assemble once more in order to undo Thanos's actions and undo the chaos to the universe, no matter what consequences may be in store, and no matter who they face.",
            "genres": [
                "Action",
                "Adventure",
                "Drama",
                "Sci-Fi"
            ],
            "photo": "https://img.tek.id/img/content/2020/01/03/24173/avengers-endgame-kembali-ungguli-avatar-rLuWTbVISy.jpg"
        },
        {
            "title": "",
            "director": "",
            "release_date": "",
            "runtime": 0,
            "rating": 0,
            "description": "",
            "genres": [
                "",
                "",
                ""
            ],
            "photos": ""
        }
    ]
}